Repository: devops365/peeringdb
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: el_gr

source: Remove
el_gr: Αφαίρεση

source: Canceled
el_gr: Ακυρώθηκε

source: Add user
el_gr: Προσθήκη Χρήστη

source: to Organization?
el_gr: προς τον Οργανισμό

source: Deny
el_gr: Απόρριψη

source: request to join the Organization?
el_gr: Αίτημα ένταξης στον οργανισμό

source: Unknown request type:
el_gr: Άγνωστος τύπος αιτήματος

source: The server rejected your data
el_gr: Ο διακομιστής απέριψε τα δεδομένα σας

source: not yet been approved
el_gr: δεν έχει ακόμη γίνει αποδεκτό

source: Parent entity pending review - please wait for it to be approved before adding entities to it
el_gr: Η αρχική εγγραφή δεν έχει εγκριθεί ακόμη - παρακαλώ περιμένετε να εγκριθεί πριν να προσθέσετε οντότητες σε αυτό

source: Exchange
el_gr: Δίκτυο ανταλλαγής

source: Participant
el_gr: Συμμετέχων

source: Facility
el_gr: Εγκατάσταση

source: Network contact
el_gr: Δικτυακή επαφή

source: Network - Exchange link
el_gr: Σύνδεσμος δικτύου ανταλλαγής

source: Network - Facility link
el_gr: Διασύνδεση δικτύου ανταλαγής

source: IXLAN Prefix
el_gr: Πρόθεμα IXLAN

source: Exchange - Facility link
el_gr: Διασύνδεση εγκατάστασης

source: Some of the fields contain invalid values - please correct and try again.
el_gr: Κάποια πεδία περιέχουν μη αποδεκτούς χαρακτήρες - παρακαλούμε διοθρώστε τα και προσπαθήστε ξανά.

source: Something went wrong.
el_gr: Κάτι πήγε στραβά.

source: Invalid value
el_gr: Λανθασμένη τιμή

source: Input required
el_gr: Απαιτείται εισαγωγή

source: Needs to match password
el_gr: Πρέπει να ταιριάζει με τον κωδικό πρόσβασης

source: Needs to be a valid email address
el_gr: Πρέπει να είναι μια έγκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου

source: Needs to be a valid url
el_gr: Πρέπει να είναι μια έγκυρη διεύθυνση

source: Needs to be a number
el_gr: Πρέπει να είναι νούμερο

source: Yes
el_gr: Ναι

source: No
el_gr: Όχι
